Vehicle-Security/Nor-Flash-Hotpatch/platform/nrf52840/config/freertos/FreeRTOSConfig.h
#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

#include <stdint.h>

#include "nrf.h"

extern uint32_t SystemCoreClock;

#define configUSE_PREEMPTION                       1
#define configUSE_TIME_SLICING                     1
#define configUSE_PORT_OPTIMISED_TASK_SELECTION    0
#define configUSE_TICK_HOOK                        0
#define configCPU_CLOCK_HZ                         ( SystemCoreClock )
#define configTICK_RATE_HZ                         ( ( TickType_t ) 1000 )
#define configMAX_PRIORITIES                       4
#define configMINIMAL_STACK_SIZE                   128
#define configTOTAL_HEAP_SIZE                      ( 24U * 1024U )
#define configMAX_TASK_NAME_LEN                    16
#define configIDLE_SHOULD_YIELD                    1
#define configUSE_TASK_NOTIFICATIONS               1
#define configTASK_NOTIFICATION_ARRAY_ENTRIES      1
#define configUSE_MUTEXES                          1
#define configQUEUE_REGISTRY_SIZE                  0
#define configCHECK_FOR_STACK_OVERFLOW             0
#define configUSE_RECURSIVE_MUTEXES                0
#define configUSE_MALLOC_FAILED_HOOK               0
#define configUSE_APPLICATION_TASK_TAG             0
#define configUSE_COUNTING_SEMAPHORES              0
#define configGENERATE_RUN_TIME_STATS              0
#define configUSE_TRACE_FACILITY                   0
#define configUSE_STATS_FORMATTING_FUNCTIONS       0
#define configUSE_TIMERS                           0
#define configSUPPORT_DYNAMIC_ALLOCATION           1
#define configSUPPORT_STATIC_ALLOCATION            0
#define configUSE_IDLE_HOOK                        0
#define configTICK_TYPE_WIDTH_IN_BITS              TICK_TYPE_WIDTH_32_BITS
#define configENABLE_BACKWARD_COMPATIBILITY        0
#define configNUMBER_OF_CORES                      1

#ifdef __NVIC_PRIO_BITS
#define configPRIO_BITS                            __NVIC_PRIO_BITS
#else
#define configPRIO_BITS                            3
#endif

#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY         7
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY    5

#define configKERNEL_INTERRUPT_PRIORITY \
    ( configLIBRARY_LOWEST_INTERRUPT_PRIORITY << ( 8 - configPRIO_BITS ) )
#define configMAX_SYSCALL_INTERRUPT_PRIORITY \
    ( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << ( 8 - configPRIO_BITS ) )

#define configASSERT(x)                                \
    do                                                 \
    {                                                  \
        if( ( x ) == 0 )                               \
        {                                              \
            taskDISABLE_INTERRUPTS();                  \
            for( ; ; )                                 \
            {                                          \
            }                                          \
        }                                              \
    } while( 0 )

#define INCLUDE_vTaskPrioritySet                  0
#define INCLUDE_uxTaskPriorityGet                 0
#define INCLUDE_vTaskDelete                       0
#define INCLUDE_vTaskSuspend                      1
#define INCLUDE_xResumeFromISR                    0
#define INCLUDE_xTaskDelayUntil                   0
#define INCLUDE_vTaskDelay                        1
#define INCLUDE_xTaskGetSchedulerState            1
#define INCLUDE_xTaskGetCurrentTaskHandle         1
#define INCLUDE_uxTaskGetStackHighWaterMark       1

#define vPortSVCHandler                           SVC_Handler
#define xPortPendSVHandler                        PendSV_Handler
#define xPortSysTickHandler                       SysTick_Handler

#endif
